# YOLOv9
# ⭐⭐Powered by https://blog.csdn.net/StopAndGoyyy,  技术指导QQ:2668825911⭐⭐
# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3
# ⭐⭐Powered by https://blog.csdn.net/StopAndGoyyy,  技术指导QQ:2668825911⭐⭐
# YOLOv9 backbone
backbone:
  [
   [-1, 1, Silence, []],

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3

   # avg-conv down
   [-1, 1, ADown, [256]],  # 4-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 5

   # avg-conv down
   [-1, 1, ADown, [512]],  # 6-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 7

   # avg-conv down
   [-1, 1, ADown, [512]],  # 8-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 9
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 10

   [[3, 5, 7, 10], 1, SimFusion_4in, []],  # 11
   [-1, 1, IFM, [[64, 32]]],  # 12

   [9, 1, Conv, [512, 1, 1]],  # 13
   [[5, 7, -1], 1, SimFusion_3in, [512]],  # 14
   [[-1, 12], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]],  # 15
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 16

   [7, 1, Conv, [256, 1, 1]],  # 17
   [[3, 5, -1], 1, SimFusion_3in, [256]],  # 18
   [[-1, 12], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]],  # 19
   [-1, 1, RepNCSPELAN4, [256, 512, 256, 1]],  # 20

   [[-1, 16, 10], 1, PyramidPoolAgg, [352, 2]],  # 21
   [-1, 1, TopBasicLayer, [352, [64, 128]]],  # 22

   [[20, 17], 1, AdvPoolFusion, []], # 23
   [[-1, 22], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 24
   [-1, 1, RepNCSPELAN4, [256, 512, 256, 1]], # 25

   [[-1, 13], 1, AdvPoolFusion, []], # 26
   [[-1, 22], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 27
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 1]], # 28


   # multi-level reversible auxiliary branch

   # routing
   [5, 1, CBLinear, [[256]]], # 29
   [7, 1, CBLinear, [[256, 512]]], # 30
   [9, 1, CBLinear, [[256, 512, 512]]], # 31

   # conv down
   [0, 1, Conv, [64, 3, 2]],  # 32-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 33-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 34

   # avg-conv down fuse
   [-1, 1, ADown, [256]],  # 35-P3/8
   [[29, 30, 31, -1], 1, CBFuse, [[0, 0, 0]]], # 36

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 37

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 38-P4/16
   [[30, 31, -1], 1, CBFuse, [[1, 1]]], # 39

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 40

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 41-P5/32
   [[31, -1], 1, CBFuse, [[2]]], # 42

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 43



   # detection head

   # detect
   [[37, 40, 43, 20, 25, 28], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
